app/Controllers/Home.php

    public function index(): string
    {
       $db= \Config\Database::connect();
       $builder = $db->table('authors');


       $builder->select("posts.*, CONCAT(authors.first_name, ' ', authors.last_name) AS author");
       $builder->join('posts', 'posts.author_id = authors.id');
       $query = $builder->get();
---
SELECT `posts`.*, CONCAT(authors.first_name, ' ', authors.last_name) AS author
FROM `authors`
JOIN `posts` ON `posts`.`author_id` = `authors`.`id`